session_3/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    #unregistered users can only read 5 articles
    if session[:user_id] && !session[:private_articles_left]
      session[:private_articles_left]=5
    end
    @articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    #to keep count of private articles read
    if session[:private_articles_left] == 0
      render "articles/limit"
    elsif session[:user_id] && !Article.find(params[:id]).public && !session[:admin]

INSERT INTO "articles" ("content", "created_at", "updated_at", "user_id", "public", "title", "topic", "tags") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.user_id = session[:user_id]


    if @article.save

UPDATE "articles" SET "content" = ?, "updated_at" = ?, "title" = ?, "topic" = ?, "tags" = ? WHERE "articles"."id" = ?  [["content", "Ruby on rails is great"], ["updated_at", "2021-01-21 14:20:01.647911"], ["title", "Rubu"], ["topic", "rails,ruby"], ["tags", "RoR"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)