session_3/blog/app/views/articles/index.html.erb

        <td><%= article.tags %></td>
        <td><%= User.find(article.user_id).name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]